In [1]:
import pandas as pd

In [2]:
countries = pd.read_csv('/Users/mattia/Desktop/DSBA/Simulation and modeling/A.Y. 2024:2025/simulation_project/data/State Exports by NAICS Commodities.csv')
countries

            Country                Time Total Exports Value ($US)  Unnamed: 3
0       World Total                2002           693,103,192,211         NaN
1       World Total        January 2002            52,667,442,467         NaN
2       World Total       February 2002            53,061,338,573         NaN
3       World Total          March 2002            60,728,372,592         NaN
4       World Total          April 2002            58,146,097,985         NaN
...             ...                 ...                       ...         ...
215219    Singapore  2025 through April            14,524,875,009         NaN
215220    Singapore        January 2025             3,117,843,756         NaN
215221    Singapore       February 2025             3,390,407,732         NaN
215222    Singapore          March 2025             3,477,194,615         NaN
215223    Singapore          April 2025             4,539,428,906         NaN

[215224 rows x 4 columns]

In [ ]:
analysis_countries = ['China', 'Hong Kong', 'France', 'Germany', 'Italy', 'Japan', 'Malaysia', 'Netherlands', 'Philippines', 'Singapore', 'Thailand', 'Korea, South',
     'Vietnam']
countries_filtered = countries[countries['Country'].isin(analysis_countries)].reset_index(drop=True)
countries_filtered = countries_filtered.loc[~ countries_filtered['Time'].str[0].isin(list('1234567890'))]

In [8]:
countries_filtered

         Country           Time Total Exports Value ($US)  Unnamed: 3
1          China   January 2002             1,569,313,503         NaN
2          China  February 2002             1,529,492,578         NaN
3          China     March 2002             1,620,488,889         NaN
4          China     April 2002             1,544,544,989         NaN
5          China       May 2002             1,773,915,631         NaN
...          ...            ...                       ...         ...
21274  Singapore  December 2024             3,533,535,385         NaN
21276  Singapore   January 2025             3,117,843,756         NaN
21277  Singapore  February 2025             3,390,407,732         NaN
21278  Singapore     March 2025             3,477,194,615         NaN
21279  Singapore     April 2025             4,539,428,906         NaN

[19600 rows x 4 columns]